
## :white_check_mark: Apply Succeeded (fxa-webhook-proxy-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/37056)



<pre><code>Apply complete! Resources: 1 added, 3 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.archive_file.proxy-lambda_fxa-events-sqs-lambda_lambda-default-file_C2204174: Reading...
data.archive_file.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-default-file_658064DB: Reading...
data.archive_file.proxy-lambda_fxa-events-sqs-lambda_lambda-default-file_C2204174: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.archive_file.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-default-file_658064DB: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.aws_ssm_parameter.proxy-lambda_service-hash_00833657: Reading...
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_assume-policy-document_B7F6A483: Reading...
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_EE183E17: Reading...
aws_s3_bucket.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket_C7C951C2: Refreshing state... [id=pocket-fxawebhookproxy-dev-apigateway-fxa-events]
aws_sqs_queue.sqs-queue_redrive_sqs_queue_7787A983: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/FxAWebhookProxy-Dev-Queue-Deadletter]
data.aws_ssm_parameter.pocket-shared-vpc_vpc_ssm_param_71599A98: Reading...
data.aws_route53_zone.apigateway-lambda_fxa-events-apigateway-lambda_base-dns_main_hosted_zone_52D95F8D: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_public_subnets_ED078BA3: Reading...
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_assume-policy-document_B7F6A483: Read complete after 0s [id=1349007126]
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_EE183E17: Read complete after 0s [id=4250039221]
data.aws_kms_alias.pocket-shared-vpc_secrets_manager_key_1721F04F: Reading...
data.aws_ssm_parameter.proxy-lambda_sentry-dsn_32A7918F: Reading...
data.aws_ssm_parameter.apigateway-lambda_service-hash_CB1C89E3: Reading...
data.aws_region.pocket-shared-vpc_current_region_847136C5: Reading...
data.aws_region.pocket-shared-vpc_current_region_847136C5: Read complete after 0s [id=us-east-1]
aws_codedeploy_app.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-app_36CDF2A9: Refreshing state... [id=d1b6522c-60c3-478d-8ce9-3503b92bf7e8:FxAWebhookProxy-Dev-ApiGateway-FxA-Events-Lambda]
data.aws_ssm_parameter.proxy-lambda_sentry-dsn_32A7918F: Read complete after 0s [id=/FxAWebhookProxy/Dev/SENTRY_DSN]
data.aws_ssm_parameter.proxy-lambda_service-hash_00833657: Read complete after 0s [id=/FxAWebhookProxy/CircleCI/Dev/SERVICE_HASH]
data.aws_ssm_parameter.pocket-shared-vpc_private_subnets_899B1172: Reading...
data.aws_ssm_parameter.pocket-shared-vpc_vpc_ssm_param_71599A98: Read complete after 0s [id=/Shared/Vpc]
aws_s3_bucket.proxy-lambda_fxa-events-sqs-lambda_code-bucket_18BE403F: Refreshing state... [id=pocket-fxawebhookproxy-dev-sqs-fxa-events]
data.aws_caller_identity.pocket-shared-vpc_current_identity_C10C97A4: Reading...
data.aws_kms_alias.pocket-shared-vpc_secrets_manager_key_1721F04F: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_ssm_parameter.pocket-shared-vpc_public_subnets_ED078BA3: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_494AA977: Reading...
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_assume-policy-document_4F92B2E4: Reading...
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_494AA977: Read complete after 0s [id=4250039221]
data.aws_caller_identity.pocket-shared-vpc_current_identity_C10C97A4: Read complete after 0s [id=410318598490]
aws_acm_certificate.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-certificate_AB4BFA3E: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/44f7d039-5849-436d-b297-7b99f18a3e8c]
data.aws_ssm_parameter.pocket-shared-vpc_private_subnets_899B1172: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.apigateway-lambda_sentry-dsn_52D8BA00: Reading...
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_assume-policy-document_4F92B2E4: Read complete after 0s [id=1349007126]
aws_codedeploy_app.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-app_BC3071ED: Refreshing state... [id=14cd1e86-b551-47de-85f5-4b5988089848:FxAWebhookProxy-Dev-Sqs-FxA-Events-Lambda]
data.aws_ssm_parameter.apigateway-lambda_sentry-dsn_52D8BA00: Read complete after 0s [id=/FxAWebhookProxy/Dev/SENTRY_DSN]
aws_route53_zone.apigateway-lambda_fxa-events-apigateway-lambda_base-dns_subhosted_zone_8A609C89: Refreshing state... [id=Z0240604T3K3R2LINSC2]
data.aws_ssm_parameter.apigateway-lambda_service-hash_CB1C89E3: Read complete after 0s [id=/FxAWebhookProxy/CircleCI/Dev/SERVICE_HASH]
aws_iam_role.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-role_0FCA3369: Refreshing state... [id=FxAWebhookProxy-Dev-ApiGateway-FxA-Events-ExecutionRole]
aws_iam_role.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-role_EAFFD8C6: Refreshing state... [id=FxAWebhookProxy-Dev-Sqs-FxA-Events-CodeDeployRole]
aws_api_gateway_rest_api.apigateway-lambda_api-gateway-rest_FD4A1018: Refreshing state... [id=ctafu7cig4]
data.aws_vpc.pocket-shared-vpc_405D247E: Reading...
aws_iam_role.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-role_2351D7DE: Refreshing state... [id=FxAWebhookProxy-Dev-ApiGateway-FxA-Events-CodeDeployRole]
aws_sqs_queue.sqs-queue_sqs_queue_46EA6754: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/FxAWebhookProxy-Dev-Queue]
data.aws_route53_zone.apigateway-lambda_fxa-events-apigateway-lambda_base-dns_main_hosted_zone_52D95F8D: Read complete after 0s [id=ZCSIDA846KWLN]
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_execution-policy-document_AC2C64C8: Reading...
aws_iam_role.proxy-lambda_fxa-events-sqs-lambda_execution-role_49DCFF7B: Refreshing state... [id=FxAWebhookProxy-Dev-Sqs-FxA-Events-ExecutionRole]
aws_iam_role_policy_attachment.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deploy-policy-attachment_4207928B: Refreshing state... [id=FxAWebhookProxy-Dev-Sqs-FxA-Events-CodeDeployRole-20230905214858118100000001]
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_execution-policy-document_AC2C64C8: Read complete after 0s [id=2780803023]
aws_iam_policy.proxy-lambda_fxa-events-sqs-lambda_execution-policy_42E5C2FC: Refreshing state... [id=arn:aws:iam::410318598490:policy/FxAWebhookProxy-Dev-Sqs-FxA-Events-ExecutionRolePolicy]
aws_codedeploy_deployment_group.proxy-lambda_fxa-events-sqs-lambda_lambda-code-deploy_code-deployment-group_768043C9: Refreshing state... [id=ab412c74-1b71-434a-93b1-97c60f673277]
aws_api_gateway_resource.apigateway-lambda_fxa-events-apigateway-lambda_events_41F30C7F: Refreshing state... [id=99rmt9]
aws_s3_bucket_public_access_block.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket-public-access-block_B05F905E: Refreshing state... [id=pocket-fxawebhookproxy-dev-apigateway-fxa-events]
aws_s3_bucket_ownership_controls.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket-ownership-controls_A8EB8BA0: Refreshing state... [id=pocket-fxawebhookproxy-dev-apigateway-fxa-events]
aws_route53_record.apigateway-lambda_fxa-events-apigateway-lambda_base-dns_subhosted_zone_ns_C49E1CCC: Refreshing state... [id=ZCSIDA846KWLN_fxa-events.getpocket.dev_NS]
data.aws_sqs_queue.proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_queue_98C8D6B7: Reading...
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy-document_E70A7233: Reading...
data.aws_iam_policy_document.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy-document_E70A7233: Read complete after 0s [id=1101181064]
aws_codedeploy_deployment_group.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deployment-group_C7221F61: Refreshing state... [id=cefa1173-aeee-44bb-a12f-419425992352]
aws_route53_record.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-certificate_certificate_record_63795587: Refreshing state... [id=Z0240604T3K3R2LINSC2__b924d728b044303d01454b39fa320314.fxa-events.getpocket.dev._CNAME]
data.aws_sqs_queue.proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_queue_98C8D6B7: Read complete after 0s [id=https://sqs.us-east-1.amazonaws.com/410318598490/FxAWebhookProxy-Dev-Queue]
aws_iam_role_policy_attachment.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_lambda-code-deploy_code-deploy-policy-attachment_71B3F162: Refreshing state... [id=FxAWebhookProxy-Dev-ApiGateway-FxA-Events-CodeDeployRole-20230905214858127200000002]
aws_iam_policy.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-policy_3C519FF1: Refreshing state... [id=arn:aws:iam::410318598490:policy/FxAWebhookProxy-Dev-ApiGateway-FxA-Events-ExecutionRolePolicy]
aws_api_gateway_method.apigateway-lambda_fxa-events-apigateway-lambda_events-method_05BB56A7: Refreshing state... [id=agm-ctafu7cig4-99rmt9-POST]
aws_s3_bucket_ownership_controls.proxy-lambda_fxa-events-sqs-lambda_code-bucket-ownership-controls_1D4EB6CA: Refreshing state... [id=pocket-fxawebhookproxy-dev-sqs-fxa-events]
aws_s3_bucket_public_access_block.proxy-lambda_fxa-events-sqs-lambda_code-bucket-public-access-block_89A7C542: Refreshing state... [id=pocket-fxawebhookproxy-dev-sqs-fxa-events]
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_policy_961AB0B5: Reading...
data.aws_iam_policy_document.proxy-lambda_fxa-events-sqs-lambda_lambda_sqs_policy_961AB0B5: Read complete after 0s [id=1937296057]
aws_iam_role_policy_attachment.proxy-lambda_fxa-events-sqs-lambda_execution-role-policy-attachment_3F345CC0: Refreshing state... [id=FxAWebhookProxy-Dev-Sqs-FxA-Events-ExecutionRole-20230905214858184200000003]
aws_iam_role_policy_attachment.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_execution-role-policy-attachment_D0B5FF91: Refreshing state... [id=FxAWebhookProxy-Dev-ApiGateway-FxA-Events-ExecutionRole-20230905214948382700000004]
aws_s3_bucket_acl.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_code-bucket-acl_7EB58285: Refreshing state... [id=pocket-fxawebhookproxy-dev-apigateway-fxa-events,private]
aws_iam_policy.proxy-lambda_fxa-events-sqs-lambda_sqs-policy_C749EED1: Refreshing state... [id=arn:aws:iam::410318598490:policy/FxAWebhookProxy-Dev-Sqs-FxA-Events-LambdaSQSPolicy]
aws_s3_bucket_acl.proxy-lambda_fxa-events-sqs-lambda_code-bucket-acl_4AD39755: Refreshing state... [id=pocket-fxawebhookproxy-dev-sqs-fxa-events,private]
aws_acm_certificate_validation.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-certificate_certificate_validation_222CD37E: Refreshing state... [id=2023-09-01 23:48:21.695 +0000 UTC]
aws_iam_role_policy_attachment.proxy-lambda_fxa-events-sqs-lambda_execution-role-policy-attachment_A9491264: Refreshing state... [id=FxAWebhookProxy-Dev-Sqs-FxA-Events-ExecutionRole-20230905214948401300000005]
data.aws_vpc.pocket-shared-vpc_405D247E: Read complete after 1s [id=vpc-012481e83ffa5e152]
data.aws_security_groups.pocket-shared-vpc_default_security_groups_27768768: Reading...
data.aws_subnets.pocket-shared-vpc_public_subnet_ids_D97DEFAB: Reading...
data.aws_subnets.pocket-shared-vpc_private_subnet_ids_8E7435AC: Reading...
data.aws_security_groups.pocket-shared-vpc_internal_security_groups_1EABF33F: Reading...
aws_api_gateway_domain_name.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-domain-name_AAD407DE: Refreshing state... [id=fxa-events.getpocket.dev]
data.aws_subnets.pocket-shared-vpc_public_subnet_ids_D97DEFAB: Read complete after 0s [id=us-east-1]
aws_route53_record.apigateway-lambda_fxa-events-apigateway-lambda_apigateway-route53-domain-record_D3B870B4: Refreshing state... [id=Z0240604T3K3R2LINSC2_fxa-events.getpocket.dev_A]
data.aws_subnets.pocket-shared-vpc_private_subnet_ids_8E7435AC: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-shared-vpc_internal_security_groups_1EABF33F: Read complete after 0s [id=us-east-1]
aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171: Refreshing state... [id=FxAWebhookProxy-Dev-ApiGateway-FxA-Events-Function]
data.aws_security_groups.pocket-shared-vpc_default_security_groups_27768768: Read complete after 0s [id=us-east-1]
aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609: Refreshing state... [id=FxAWebhookProxy-Dev-Sqs-FxA-Events-Function]
aws_lambda_alias.proxy-lambda_fxa-events-sqs-lambda_alias_AD7643EF: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:FxAWebhookProxy-Dev-Sqs-FxA-Events-Function:DEPLOYED]
aws_cloudwatch_log_group.proxy-lambda_fxa-events-sqs-lambda_log-group_026C85E5: Refreshing state... [id=/aws/lambda/FxAWebhookProxy-Dev-Sqs-FxA-Events-Function]
aws_lambda_alias.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_alias_48A3E53D: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:FxAWebhookProxy-Dev-ApiGateway-FxA-Events-Function:DEPLOYED]
aws_cloudwatch_log_group.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_log-group_FCA0AB36: Refreshing state... [id=/aws/lambda/FxAWebhookProxy-Dev-ApiGateway-FxA-Events-Function]
aws_lambda_event_source_mapping.proxy-lambda_fxa-events-sqs-lambda_lambda_event_source_mapping_0005C71C: Refreshing state... [id=f0282de2-6c7c-4bab-8b6d-4eb1ffb1ce0e]
aws_api_gateway_integration.apigateway-lambda_fxa-events-apigateway-lambda_events-integration_481F0AED: Refreshing state... [id=agi-ctafu7cig4-99rmt9-POST]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Refreshing state... [id=7z684u]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Refreshing state... [id=ags-ctafu7cig4-dev]
aws_lambda_permission.apigateway-lambda_fxa-events-apigateway-lambda_apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_alias_48A3E53D-allow-gateway-lambda-invoke_2CBDADB9: Refreshing state... [id=terraform-20230905215005128700000006]
aws_api_gateway_base_path_mapping.apigateway-lambda_fxa-events-apigateway-lambda_api-gateway-base-path-mapping_E3B14CBE: Refreshing state... [id=fxa-events.getpocket.dev/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-02-02T23:04:59Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:410318598490:ctafu7cig4/" -> (known after apply)
      ~ id            = "7z684u" -> (known after apply)
      ~ invoke_url    = "https://ctafu7cig4.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1706915058573" -> "1706916060819"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "7z684u" -> (known after apply)
        id                    = "ags-ctafu7cig4-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171 will be updated in-place
  ~ resource "aws_lambda_function" "apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171" {
        id                             = "FxAWebhookProxy-Dev-ApiGateway-FxA-Events-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:FxAWebhookProxy-Dev-ApiGateway-FxA-Events-Function:138" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:FxAWebhookProxy-Dev-ApiGateway-FxA-Events-Function:138/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "138" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"            = (sensitive value)
                # (3 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609 will be updated in-place
  ~ resource "aws_lambda_function" "proxy-lambda_fxa-events-sqs-lambda_39345609" {
        id                             = "FxAWebhookProxy-Dev-Sqs-FxA-Events-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:FxAWebhookProxy-Dev-Sqs-FxA-Events-Function:149" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:FxAWebhookProxy-Dev-Sqs-FxA-Events-Function:149/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Dev"
            "service"     = "FxAWebhookProxy"
        }
      ~ version                        = "149" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"     = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609: Modifying... [id=FxAWebhookProxy-Dev-Sqs-FxA-Events-Function]
aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171: Modifying... [id=FxAWebhookProxy-Dev-ApiGateway-FxA-Events-Function]
aws_lambda_function.proxy-lambda_fxa-events-sqs-lambda_39345609: Modifications complete after 7s [id=FxAWebhookProxy-Dev-Sqs-FxA-Events-Function]
aws_lambda_function.apigateway-lambda_fxa-events-apigateway-lambda_events-lambda_06645171: Modifications complete after 7s [id=FxAWebhookProxy-Dev-ApiGateway-FxA-Events-Function]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Creating...
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Creation complete after 0s [id=ut2yeg]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Modifying... [id=ags-ctafu7cig4-dev]
aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9: Modifications complete after 0s [id=ags-ctafu7cig4-dev]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 (deposed object d1636825): Destroying... [id=7z684u]
aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512: Destruction complete after 1s

Apply complete! Resources: 1 added, 3 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"bb48faa7-b81b-4ab5-be97-5cce60c2baa6","JobName":"fxa-webhook-proxy_infrastructure_apply_dev","PRNumber":139,"Program":"tfcmt","SHA1":"b60c84cd2825d41a1bbf81c1213eb00da0632422","Target":"fxa-webhook-proxy-cdk-dev","Vars":{}} -->